cask_args appdir: '/Applications'
# Taps
tap 'homebrew/bundle'
tap "homebrew/cask-fonts"
tap 'buo/cask-upgrade'

# Development
brew 'cloudflared'
brew 'neovim' # A better vim
brew 'python'
brew 'redis'
brew 'ruby-build'

# Binaries
brew 'bat'
brew 'coreutils'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'mackup'
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'wget'
brew 'zsh'

# Media
brew 'imagemagick'
brew 'ffmpeg'
brew 'yt-dlp'

# Apps
cask '1password'
cask 'airtable'
cask 'applite'
cask 'arq'
cask 'diffusionbee'
cask 'handbrake'
cask 'latest'
cask 'messenger'
cask 'plex'
cask 'transmission'
cask 'raycast'
cask 'warp'
cask 'whatsapp'
cask 'vlc'
cask 'zed'
cask 'zoom'

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"
cask "font-symbols-only-nerd-font"
cask "font-recursive-code"
cask "font-monaspace"